strange_list = ["str", 2, 6.5, True, None, (1, 2, 3)]
for a in strange_list:
    print(type(a))

# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
